// pages/searchResult/searchResult.js
const app=getApp();
Page({

  /**
   * 页面的初始数据
   */
  data: {
    bottom_height:app.screen_res.bottomSafeHeight,
    search_value:"",
    search_result:[{
      id:"123456789",
      title:"检察机关依法惩治拒不支付劳动报酬犯罪典型案例",
      key:"www",
      type:"type",
      time:"2012-03-26",
      status:"草稿",
      text_brief:"简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介"
    },
    {
      id:"123456789",
      title:"检察机关依法惩治拒不支付劳动报酬犯罪典型案例",
      key:"www",
      type:"type",
      time:"2012-03-26",
      status:"草稿",
      text_brief:"简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介"
    },
    {
      id:"123456789",
      title:"检察机关依法惩治拒不支付劳动报酬犯罪典型案例",
      key:"www",
      type:"type",
      time:"2012-03-26",
      status:"草稿",
      text_brief:"简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介"
    },
    {
      id:"123456789",
      title:"检察机关依法惩治拒不支付劳动报酬犯罪典型案例",
      key:"www",
      type:"type",
      time:"2012-03-26",
      status:"草稿",
      text_brief:"简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介"
    },
    {
      id:"123456789",
      title:"检察机关依法惩治拒不支付劳动报酬犯罪典型案例",
      key:"www",
      type:"type",
      time:"2012-03-26",
      status:"草稿",
      text_brief:"简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介"
    },
    {
      id:"123456789",
      title:"检察机关依法惩治拒不支付劳动报酬犯罪典型案例",
      key:"www",
      type:"type",
      time:"2012-03-26",
      status:"草稿",
      text_brief:"简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介简介"
    },
  ]

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {
    this.setData({
      search_value:options.search,
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})